<?php
$s = 0;
$sS = 0;
$ar1 = [];
$ar2 = [];
for($d1 = 0; $d1 < 10; $d1++) {
    $ar1[1] = $d1;
    for($d2 = 0; $d2 < 10; $d2++) {
        $ar1[2] = $d2;
        for($d3 = 0; $d3 < 10; $d3++){
            $ar1[3] = $d3;

            for($d4 = 0; $d4 < 10; $d4++){
                $ar2[1] = $d4;
                for($d5 = 0; $d5 < 10; $d5++) {
                    $ar2[2] = $d5;
                    for($d6 = 0; $d6 < 10; $d6++) {
                        $ar2[3] = $d6;
                        if($d1+$d2+$d3 == $d4+$d5+$d6) $s++;
                        sort($ar1);
                        sort($ar2);
                        if($ar1 == $ar2) $sS++;
                    }
                }
            }
        }
    }
}

echo "Cчастливых билетов(без учета симметричных): ".($sS - $s)."<br>";
echo "Сумма от продажи: ".(($sS - $s)*3)."руб.<br>";

echo "Cимметричных билетов: ".$sS."<br>";
echo "Сумма от продажи: ".($sS*10)."<br>";

echo "Затраты бизнесменов за 10 мес.: ".(20000*10)."<br>";
echo "Сумма дохода: ".((($sS - $s)*3)+($sS*10))."<br>";

echo "Чистая прибыль: ".(((($sS - $s)*3)+($sS*10))-(20000*10));
